In [1]:
import pandas as pd

In [2]:
data = {
    "Student_ID": [101, 102, 103, 104, 105, 106],
    "Name": ["Amit", "Neha", "Ravi", "Pooja", "Suresh", "Kiran"],
    "Age": [20, 21, 19, 22, 20, 21],
    "Gender": ["M", "F", "M", "F", "M", "M"],
    "Department": ["CS", "IT", "CS", "EC", "IT", "CS"],
    "Marks": [85, 78, 92, 66, 74, 88],
    "Attendance": [90, 85, 95, 80, 88, 92]
}

In [4]:
df = pd.DataFrame(data)
df

   Student_ID    Name  Age Gender Department  Marks  Attendance
0         101    Amit   20      M         CS     85          90
1         102    Neha   21      F         IT     78          85
2         103    Ravi   19      M         CS     92          95
3         104   Pooja   22      F         EC     66          80
4         105  Suresh   20      M         IT     74          88
5         106   Kiran   21      M         CS     88          92

In [19]:
df.head(3)

   Student_ID  Name  Age Gender Department  Marks  Attendance
0         101  Amit   20      M         CS     85          90
1         102  Neha   21      F         IT     78          85
2         103  Ravi   19      M         CS     92          95

In [ ]:
df.shape

(6, 7)

In [ ]:
df[['Name','Marks']]

     Name  Marks
0    Amit     85
1    Neha     78
2    Ravi     92
3   Pooja     66
4  Suresh     74
5   Kiran     88

In [22]:
print(df['Marks'].mean())

80.5

In [23]:
df['Department'].value_counts()

Department
CS    3
IT    2
EC    1
Name: count, dtype: int64

In [25]:
df[df['Marks']>80]['Name']

0     Amit
2     Ravi
5    Kiran
Name: Name, dtype: object

In [28]:
df[(df['Department']=='CS') & (df['Marks'] >= 80)]

   Student_ID   Name  Age Gender Department  Marks  Attendance
0         101   Amit   20      M         CS     85          90
2         103   Ravi   19      M         CS     92          95
5         106  Kiran   21      M         CS     88          92

In [34]:
df.sort_values(by='Marks',ascending = False)

   Student_ID    Name  Age Gender Department  Marks  Attendance
2         103    Ravi   19      M         CS     92          95
5         106   Kiran   21      M         CS     88          92
0         101    Amit   20      M         CS     85          90
1         102    Neha   21      F         IT     78          85
4         105  Suresh   20      M         IT     74          88
3         104   Pooja   22      F         EC     66          80

In [38]:
df['Result'] = df['Marks'].apply(lambda x: "Pass" if x>75 else "Fail")
df

   Student_ID    Name  Age Gender Department  Marks  Attendance Result
0         101    Amit   20      M         CS     85          90   Pass
1         102    Neha   21      F         IT     78          85   Pass
2         103    Ravi   19      M         CS     92          95   Pass
3         104   Pooja   22      F         EC     66          80   Fail
4         105  Suresh   20      M         IT     74          88   Fail
5         106   Kiran   21      M         CS     88          92   Pass

In [39]:
df['Attendance'].max()

np.int64(95)